Repository: htirawi/geo_master
Catalog: lib/l10n/app_*.arb
Languages: ar

# appName
source: GeoMaster
ar: أطلس العالم

# appTitle
source: GeoMaster
ar: أطلس العالم

# appTagline
source: Explore the World
ar: استكشف العالم

# welcomeMessage
source: Welcome, {name}!
ar: مرحباً، {name}!

# welcomeBack
source: Welcome back! Sign in to continue.
ar: مرحباً بعودتك! سجل الدخول للمتابعة.

source: Good morning
ar: صباح الخير

source: Good afternoon
ar: مساء الخير

source: Good evening
ar: مساء الخير

source: Select Language
ar: اختر اللغة

# continueText
source: Continue
ar: متابعة

source: Skip
ar: تخطي

source: Next
ar: التالي

source: Back
ar: رجوع

source: Done
ar: تم

source: Cancel
ar: إلغاء

source: Save
ar: حفظ

source: Delete
ar: حذف

source: Edit
ar: تعديل

source: Close
ar: إغلاق

source: Retry
ar: إعادة المحاولة

source: Loading...
ar: جاري التحميل...

source: Error
ar: خطأ

source: Success
ar: نجاح

source: Warning
ar: تحذير

source: Sign In
ar: تسجيل الدخول

source: Sign Up
ar: إنشاء حساب

source: Sign Out
ar: تسجيل الخروج

source: Signing out...
ar: جارٍ تسجيل الخروج...

source: Continue with Google
ar: المتابعة مع جوجل

source: Continue with Apple
ar: المتابعة مع أبل

source: Continue with Email
ar: المتابعة بالبريد الإلكتروني

source: Continue as Guest
ar: المتابعة كضيف

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Confirm Password
ar: تأكيد كلمة المرور

source: Show password
ar: إظهار كلمة المرور

source: Hide password
ar: إخفاء كلمة المرور

source: Forgot Password?
ar: نسيت كلمة المرور؟

source: Reset Password
ar: إعادة تعيين كلمة المرور

source: Create Account
ar: إنشاء حساب

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

source: or
ar: أو

# termsAgreement
source: By continuing, you agree to our Terms of Service and Privacy Policy
ar: بالمتابعة، فإنك توافق على شروط الخدمة وسياسة الخصوصية

# termsCheckbox
source: I agree to the
ar: أوافق على

# termsOfServiceLink
source: Terms of Service
ar: شروط الخدمة

# privacyPolicyLink
source: Privacy Policy
ar: سياسة الخصوصية

# andText
source: and
ar: و

# pleaseAcceptTerms
source: Please accept the Terms of Service and Privacy Policy to continue
ar: يرجى الموافقة على شروط الخدمة وسياسة الخصوصية للمتابعة

source: Guest
ar: ضيف

# guestModeDescription
source: Try the app without signing in
ar: جرب التطبيق بدون تسجيل الدخول

# onboardingTitle1
source: Welcome to Your Journey
ar: مرحباً برحلتك

# onboardingSubtitle1
source: Learn geography the fun way!
ar: تعلم الجغرافيا بطريقة ممتعة!

# onboardingTitle2
source: Interactive Learning
ar: تعلم تفاعلي

# onboardingSubtitle2
source: Answer questions, earn rewards
ar: أجب على الأسئلة واكسب المكافآت

# onboardingTitle3
source: Powered by AI
ar: مدعوم بالذكاء الاصطناعي

# onboardingSubtitle3
source: Your personal geography tutor
ar: معلمك الشخصي في الجغرافيا

# onboardingTitle4
source: Track Your Progress
ar: تتبع تقدمك

# onboardingSubtitle4
source: Watch yourself become a geography master
ar: شاهد نفسك تصبح خبيراً في الجغرافيا

# onboardingExploreTitle
source: Explore the World
ar: استكشف العالم

# onboardingExploreDescription
source: Discover fascinating facts about every country on Earth
ar: اكتشف حقائق مذهلة عن كل دولة في العالم

# onboardingQuizTitle
source: Test Your Knowledge
ar: اختبر معلوماتك

# onboardingQuizDescription
source: Challenge yourself with fun quizzes on capitals, flags, and more
ar: تحدَّ نفسك باختبارات ممتعة عن العواصم والأعلام والمزيد

# onboardingAiTitle
source: AI-Powered Learning
ar: تعلم بالذكاء الاصطناعي

# onboardingAiDescription
source: Get personalized help from your AI geography tutor
ar: احصل على مساعدة شخصية من معلم الجغرافيا الذكي

# onboardingAchievementsTitle
source: Earn Achievements
ar: اكسب الإنجازات

# onboardingAchievementsDescription
source: Unlock badges, climb leaderboards, and track your progress
ar: افتح الشارات، وتسلق لوحات المتصدرين، وتتبع تقدمك

source: Get Started
ar: ابدأ الآن

source: What's your name?
ar: ما اسمك؟

source: Enter your name
ar: أدخل اسمك

# geographyLevel
source: What's your current geography level?
ar: ما هو مستواك في الجغرافيا؟

# levelBeginner
source: Beginner
ar: مبتدئ

# levelBeginnerDescription
source: 0-20% world knowledge
ar: 0-20% معرفة بالعالم

# levelIntermediate
source: Intermediate
ar: متوسط

# levelIntermediateDescription
source: 20-60% world knowledge
ar: 20-60% معرفة بالعالم

# levelAdvanced
source: Advanced
ar: متقدم

# levelAdvancedDescription
source: 60%+ world knowledge
ar: 60%+ معرفة بالعالم

# whatInterestsYou
source: What interests you most?
ar: ما الذي يثير اهتمامك أكثر؟

# interestHistory
source: History & Culture
ar: التاريخ والثقافة

# interestLanguages
source: Languages
ar: اللغات

# interestTravel
source: Travel & Tourism
ar: السفر والسياحة

# interestPolitics
source: Politics & Economics
ar: السياسة والاقتصاد

# interestNature
source: Nature & Climate
ar: الطبيعة والمناخ

# setLearningGoal
source: Set your learning goal
ar: حدد هدفك التعليمي

# minutes5PerDay
source: 5 minutes/day
ar: 5 دقائق/يوم

# minutes15PerDay
source: 15 minutes/day
ar: 15 دقيقة/يوم

# minutes30PerDay
source: 30 minutes/day
ar: 30 دقيقة/يوم

# customGoal
source: Custom
ar: مخصص

# personalizeExperience
source: Personalize Your Experience
ar: خصص تجربتك

# selectAtLeastOne
source: Select at least one topic
ar: اختر موضوعاً واحداً على الأقل

# interestCapitals
source: Capitals
ar: العواصم

# interestFlags
source: Flags
ar: الأعلام

# interestGeography
source: Geography
ar: الجغرافيا

# interestCulture
source: Culture
ar: الثقافة

# chooseDifficulty
source: Choose Your Difficulty
ar: اختر مستوى الصعوبة

# canChangeAnytime
source: You can change this anytime in settings
ar: يمكنك تغيير هذا في أي وقت من الإعدادات

# difficultyEasy
source: Easy
ar: سهل

# difficultyMedium
source: Medium
ar: متوسط

# difficultyHard
source: Hard
ar: صعب

# difficultyEasyDescription
source: Perfect for beginners
ar: مثالي للمبتدئين

# difficultyMediumDescription
source: For intermediate learners
ar: للمتعلمين المتوسطين

# difficultyHardDescription
source: For geography experts
ar: لخبراء الجغرافيا

# setYourGoal
source: Set Your Learning Goal
ar: حدد هدفك التعليمي

# howMuchTimePerDay
source: How much time do you want to spend learning each day?
ar: كم من الوقت تريد أن تقضيه في التعلم يومياً؟

# goalCasual
source: Casual
ar: عادي

# goalCasualDescription
source: 5 mins/day
ar: 5 دقائق/يوم

# goalRegular
source: Regular
ar: منتظم

# goalRegularDescription
source: 15 mins/day
ar: 15 دقيقة/يوم

# goalSerious
source: Serious
ar: جاد

# goalSeriousDescription
source: 30 mins/day
ar: 30 دقيقة/يوم

# goalIntense
source: Intense
ar: مكثف

# goalIntenseDescription
source: 60 mins/day
ar: 60 دقيقة/يوم

source: Let's Go!
ar: هيا نبدأ!

source: Enable notifications?
ar: تفعيل الإشعارات؟

source: Daily reminder
ar: تذكير يومي

source: Achievement unlocks
ar: فتح الإنجازات

source: Friend challenges
ar: تحديات الأصدقاء

source: Let's Start!
ar: هيا نبدأ!

source: Home
ar: الرئيسية

source: Explore
ar: استكشاف

source: Quiz
ar: اختبار

source: Stats
ar: الإحصائيات

source: Profile
ar: الملف الشخصي

source: Daily Challenge
ar: التحدي اليومي

# dailyChallengeDescription
source: Complete today's challenge to earn bonus XP!
ar: أكمل تحدي اليوم لكسب نقاط إضافية!

source: Start Challenge
ar: ابدأ التحدي

source: Quick Actions
ar: إجراءات سريعة

source: Quick Quiz
ar: اختبار

source: Country of the Day
ar: دولة اليوم

source: Learn More
ar: تعلم المزيد

source: Recent Progress
ar: التقدم الأخير

# dayStreak
source: {count} Day Streak!
ar: سلسلة أيام

# keepItUp
source: Keep it up! You're on fire!
ar: واصل! أنت متألق!

# timeLeft
source: Time left: {time}
ar: الوقت المتبقي: {time}

source: Claim Reward
ar: استلام المكافأة

source: Streak
ar: السلسلة

source: XP
ar: نقاط الخبرة

# xpAmount
source: {amount} XP
ar: {amount} نقطة

source: Level
ar: المستوى

source: Level {number}
ar: المستوى {number}

source: Progress
ar: التقدم

# progressPercent
source: {percent}% Complete
ar: {percent}% مكتمل

source: Explore World
ar: استكشف العالم

source: World Map
ar: خريطة العالم

source: Continents
ar: القارات

source: Countries
ar: الدول

source: Africa
ar: أفريقيا

source: Asia
ar: آسيا

source: Europe
ar: أوروبا

source: North America
ar: أمريكا الشمالية

source: South America
ar: أمريكا الجنوبية

source: Oceania
ar: أوقيانوسيا

source: Antarctica
ar: القارة القطبية الجنوبية

source: Tap to explore
ar: اضغط للاستكشاف

source: Capital
ar: العاصمة

source: Population
ar: عدد السكان

source: Area
ar: المساحة

source: Region
ar: المنطقة

source: Subregion
ar: المنطقة الفرعية

source: Languages
ar: اللغات

source: Currencies
ar: العملات

source: Timezones
ar: المناطق الزمنية

source: Borders
ar: الحدود

source: Flag
ar: العلم

source: Coat of Arms
ar: شعار النبالة

source: Location
ar: الموقع

source: Details
ar: التفاصيل

source: Coordinates
ar: الإحداثيات

source: Official Name
ar: الاسم الرسمي

source: Country Code
ar: رمز الدولة

source: UN Member
ar: عضو الأمم المتحدة

source: Landlocked
ar: غير ساحلية

source: Driving Side
ar: جهة القيادة

source: Left
ar: يسار

source: Right
ar: يمين

source: Yes
ar: نعم

source: No
ar: لا

source: View on Map
ar: عرض على الخريطة

source: Country not found
ar: لم يتم العثور على الدولة

source: Weather
ar: الطقس

source: Current Weather
ar: الطقس الحالي

source: Feels like
ar: يشعر مثل

source: Humidity
ar: الرطوبة

source: Wind
ar: الرياح

source: Sunrise
ar: شروق الشمس

source: Sunset
ar: غروب الشمس

# weatherUnavailable
source: Weather data unavailable
ar: بيانات الطقس غير متاحة

source: Clear
ar: صافي

# clouds
source: Cloudy
ar: غائم

# rain
source: Rainy
ar: ممطر

source: Drizzle
ar: رذاذ

source: Thunderstorm
ar: عاصفة رعدية

source: Snow
ar: ثلج

source: Mist
ar: ضباب

source: Haze
ar: ضبابي

source: Search countries...
ar: ابحث عن الدول...

source: No countries found
ar: لم يتم العثور على دول

source: Filter by region
ar: تصفية حسب المنطقة

source: All Regions
ar: جميع المناطق

# listView
source: List
ar: قائمة

# mapView
source: Map
ar: خريطة

source: Learning Modes
ar: أوضاع التعلم

# quickQuizDescription
source: 5 minutes
ar: 5 دقائق

source: AI Tutor
ar: المعلم الذكي

# aiTutorDescription
source: Chat with your tutor
ar: تحدث مع معلمك

source: Challenge Mode
ar: وضع التحدي

# challengeModeDescription
source: Test your skills
ar: اختبر مهاراتك

source: Story Time
ar: وقت القصة

# storyTimeDescription
source: Learn through stories
ar: تعلم من خلال القصص

source: Audio Learning
ar: التعلم الصوتي

# audioLearningDescription
source: Listen and learn
ar: استمع وتعلم

source: Quiz Modes
ar: أوضاع الاختبار

# capitalsQuiz
source: Capitals
ar: العواصم

# flagsQuiz
source: Flags
ar: الأعلام

# mapsQuiz
source: Maps
ar: الخرائط

# populationQuiz
source: Population
ar: السكان

# currenciesQuiz
source: Currencies
ar: العملات

# languagesQuiz
source: Languages
ar: اللغات

# mixedQuiz
source: Mixed
ar: مختلط

source: Select Quiz Mode
ar: اختر وضع الاختبار

# quizModeCapitals
source: Capitals Quiz
ar: اختبار العواصم

# quizModeCapitalsDescription
source: Name the capitals of countries
ar: سمِّ عواصم الدول

# quizModeFlags
source: Flags Quiz
ar: اختبار الأعلام

# quizModeFlagsDescription
source: Identify flags from around the world
ar: تعرف على أعلام العالم

# quizModeMap
source: Map Quiz
ar: اختبار الخريطة

# quizModeMapDescription
source: Find countries on the map
ar: جد الدول على الخريطة

# quizModePopulation
source: Population Quiz
ar: اختبار السكان

# quizModePopulationDescription
source: Compare country populations
ar: قارن بين سكان الدول

# quizModeCurrency
source: Currency Quiz
ar: اختبار العملات

# quizModeCurrencyDescription
source: Match currencies to countries
ar: طابق العملات بالدول

source: questions
ar: سؤال

source: Select Difficulty
ar: اختر الصعوبة

source: Difficulty
ar: الصعوبة

source: Easy
ar: سهل

source: Medium
ar: متوسط

source: Hard
ar: صعب

source: Start Quiz
ar: ابدأ الاختبار

source: Question
ar: سؤال

# questionNumber
source: Question {current} of {total}
ar: السؤال {current} من {total}

source: Correct!
ar: صحيح!

source: Incorrect
ar: خطأ

# theAnswerWas
source: The answer was: {answer}
ar: الإجابة الصحيحة: {answer}

source: Quiz Complete!
ar: انتهى الاختبار!

source: Your Score
ar: نتيجتك

# scoreResult
source: {correct} out of {total}
ar: {correct} من {total}

source: Accuracy
ar: الدقة

# correctAnswers
source: Correct
ar: الصحيحة

source: Time Taken
ar: الوقت المستغرق

source: XP Earned
ar: النقاط المكتسبة

source: Perfect Score!
ar: نتيجة مثالية!

source: Play Again
ar: إعادة اللعب

source: Back to Home
ar: العودة للرئيسية

source: Ask AI Tutor
ar: اسأل المعلم الذكي

source: Type your question...
ar: اكتب سؤالك...

source: Suggested Questions
ar: أسئلة مقترحة

source: Clear Chat
ar: مسح المحادثة

# aiThinking
source: Thinking...
ar: جاري التفكير...

source: Achievements
ar: الإنجازات

source: Achievement Unlocked!
ar: تم فتح إنجاز!

# viewAllAchievements
source: View All
ar: عرض الكل

source: Locked
ar: مقفل

source: Unlocked
ar: مفتوح

source: Leaderboard
ar: لوحة المتصدرين

source: Global
ar: عالمي

source: Friends
ar: الأصدقاء

source: Weekly
ar: أسبوعي

source: All Time
ar: كل الأوقات

source: Your Rank
ar: ترتيبك

source: Rank
ar: الترتيب

source: Weekly Stats
ar: إحصائيات الأسبوع

# countriesLearned
source: Countries
ar: الدول

source: Questions Answered
ar: الأسئلة المجاب عليها

source: Accuracy Rate
ar: معدل الدقة

# quizzesCompleted
source: Quizzes
ar: الاختبارات

source: Earned
ar: مكتسبة

source: Geography Explorer
ar: مستكشف الجغرافيا

source: to next level
ar: للمستوى التالي

source: Progress by Region
ar: التقدم حسب المنطقة

source: Settings
ar: الإعدادات

source: Account
ar: الحساب

source: Notifications
ar: الإشعارات

source: Appearance
ar: المظهر

source: Dark Mode
ar: الوضع الداكن

source: Light Mode
ar: الوضع الفاتح

source: System Default
ar: إعدادات النظام

source: Theme
ar: المظهر

source: Language
ar: اللغة

source: Preferences
ar: التفضيلات

source: Learning Preferences
ar: تفضيلات التعلم

source: Daily Goal
ar: الهدف اليومي

# minutesPerDay
source: minutes/day
ar: دقيقة/يوم

# helpAndSupport
source: Help & Support
ar: المساعدة والدعم

# signOutConfirmation
source: Are you sure you want to sign out?
ar: هل أنت متأكد من تسجيل الخروج؟

source: Upgrade to Premium
ar: الترقية إلى بريميوم

# unlockAllFeatures
source: Unlock all features and remove ads
ar: افتح جميع الميزات وأزل الإعلانات

source: Upgrade
ar: ترقية

source: Sound
ar: الصوت

source: Sound Effects
ar: المؤثرات الصوتية

source: Haptics
ar: الاهتزاز

source: Privacy
ar: الخصوصية

source: Terms of Service
ar: شروط الخدمة

source: Privacy Policy
ar: سياسة الخصوصية

source: About
ar: حول

source: Version
ar: الإصدار

source: Rate App
ar: تقييم التطبيق

source: Share App
ar: مشاركة التطبيق

source: Contact Us
ar: تواصل معنا

source: Delete Account
ar: حذف الحساب

source: Enabled
ar: مُفعّل

source: Disabled
ar: مُعطّل

source: Push Notifications
ar: الإشعارات الفورية

source: Haptic Feedback
ar: الاستجابة اللمسية

# createAccountDescription
source: Create an account to sync your progress across devices and unlock additional features.
ar: أنشئ حساباً لمزامنة تقدمك عبر الأجهزة وفتح ميزات إضافية.

# difficultyEasyDesc
source: Perfect for beginners
ar: مثالي للمبتدئين

# difficultyMediumDesc
source: Balanced challenge
ar: تحدٍّ متوازن

# difficultyHardDesc
source: For geography experts
ar: لخبراء الجغرافيا

source: Premium
ar: بريميوم

source: PREMIUM EXPLORER
ar: مستكشف بريميوم

source: Go Premium
ar: الترقية لبريميوم

source: Premium Features
ar: ميزات بريميوم

source: Unlimited Quizzes
ar: اختبارات غير محدودة

source: Unlimited AI Chat
ar: محادثات غير محدودة مع المعلم الذكي

source: Offline Access
ar: الوصول بدون إنترنت

source: No Ads
ar: بدون إعلانات

source: Streak Freeze
ar: تجميد السلسلة

source: Exclusive Achievements
ar: إنجازات حصرية

source: Subscribe
ar: اشترك

source: Restore Purchases
ar: استعادة المشتريات

# subscriptionManagement
source: Manage Subscription
ar: إدارة الاشتراك

# perMonth
source: /month
ar: /شهر

# perYear
source: /year
ar: /سنة

source: Free Trial
ar: تجربة مجانية

source: Best Value
ar: أفضل قيمة

# errorNoInternet
source: No internet connection. Please check your network.
ar: لا يوجد اتصال بالإنترنت. يرجى التحقق من الشبكة.

# errorServer
source: Server error. Please try again later.
ar: خطأ في الخادم. يرجى المحاولة لاحقاً.

# errorUnknown
source: An unexpected error occurred.
ar: حدث خطأ غير متوقع.

# errorTimeout
source: Connection timed out. Please try again.
ar: انتهت مهلة الاتصال. يرجى المحاولة مرة أخرى.

# errorAuthFailed
source: Authentication failed. Please sign in again.
ar: فشل التحقق. يرجى تسجيل الدخول مرة أخرى.

# whatCapitalOf
source: What is the capital of {country}?
ar: ما هي عاصمة {country}؟

# whichFlagBelongsTo
source: Which flag belongs to {country}?
ar: لأي دولة ينتمي هذا العلم {country}؟

source: Where is {country} located?
ar: أين تقع {country}؟

# whichCountryHasLargerPopulation
source: Which country has a larger population?
ar: أي دولة لديها عدد سكان أكبر؟

# whichCurrencyUsedIn
source: Which currency is used in {country}?
ar: ما هي العملة المستخدمة في {country}؟

source: Create your account
ar: أنشئ حسابك

# enterDetailsToGetStarted
source: Enter your details to get started
ar: أدخل بياناتك للبدء

# enterCredentialsToSignIn
source: Enter your credentials to sign in
ar: أدخل بيانات الدخول

source: Display Name
ar: اسم العرض

# emailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب

# invalidEmail
source: Please enter a valid email address
ar: يرجى إدخال بريد إلكتروني صحيح

# passwordRequired
source: Password is required
ar: كلمة المرور مطلوبة

# passwordTooShort
source: Password must be at least 6 characters
ar: كلمة المرور يجب أن تكون 6 أحرف على الأقل

source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# resetPasswordDescription
source: Enter your email address and we'll send you a link to reset your password.
ar: أدخل بريدك الإلكتروني وسنرسل لك رابطاً لإعادة تعيين كلمة المرور.

# resetEmailSent
source: Password reset email sent. Check your inbox.
ar: تم إرسال بريد إعادة تعيين كلمة المرور. تحقق من صندوق الوارد.

# failedToSendResetEmail
source: Failed to send reset email. Please try again.
ar: فشل إرسال بريد إعادة التعيين. يرجى المحاولة مرة أخرى.

source: Send
ar: إرسال

# loadingJourney
source: Loading your journey...
ar: جاري تحميل رحلتك...

source: Interactive Map
ar: خريطة تفاعلية

# mapComingSoon
source: Google Maps integration coming soon
ar: خرائط جوجل قريباً

# proBadge
source: PRO
ar: برو

source: All
ar: الكل

source: Americas
ar: الأمريكتان

source: Continue in {language}
ar: المتابعة بـ{language}

# chooseYourLanguage
source: Choose your preferred language
ar: اختر لغتك المفضلة

# quizzesLabel
source: Quizzes
ar: الاختبارات

# countriesLabel
source: Countries
ar: الدول

# xpLabel
source: XP
ar: نقاط

source: Explorer
ar: مستكشف

# readyToExplore
source: Ready to explore the world?
ar: هل أنت مستعد لاستكشاف العالم؟

source: Expedition Streak
ar: سلسلة الاستكشاف

# startStreak
source: Start your expedition today!
ar: ابدأ رحلتك اليوم!

source: days
ar: أيام

source: World Progress
ar: تقدمك في العالم

source: View All
ar: عرض الكل

# mon
source: M
ar: ن

# tue
source: T
ar: ث

# wed
source: W
ar: ر

# thu
source: T
ar: خ

# fri
source: F
ar: ج

# sat
source: S
ar: س

# sun
source: S
ar: ح

source: Challenge Arena
ar: ساحة التحدي

# selectChallenge
source: Select Your Challenge
ar: اختر تحديك

source: Your Stats
ar: إحصائياتك

source: Difficulty Level
ar: مستوى الصعوبة

source: World Atlas
ar: أطلس العالم

source: Discover Countries
ar: اكتشف الدول

# explorerJournal
source: Explorer's Journal
ar: دفتر المستكشف

source: Journey Progress
ar: تقدم الرحلة

# passportTitle
source: My Passport
ar: جواز سفري

source: Traveler Info
ar: معلومات الرحالة

source: Total Countries
ar: إجمالي الدول

source: Avg. Accuracy
ar: متوسط الدقة

source: Best Streak
ar: أفضل سلسلة

source: Recent Achievements
ar: الإنجازات الأخيرة

source: Regions
ar: المناطق

source: Discovered Countries
ar: الدول المكتشفة

# easyDescription
source: Relaxed exploration
ar: استكشاف مريح

# mediumDescription
source: Balanced challenge
ar: تحدي متوازن

# hardDescription
source: Expert expedition
ar: رحلة الخبراء

# travelerIdSubtitle
source: World Explorer ID
ar: هوية المستكشف العالمي

source: Traveler Name
ar: اسم الرحالة

# contactEmail
source: Contact
ar: البريد الإلكتروني

# countriesVisited
source: Countries
ar: الدول

source: Journey Stats
ar: إحصائيات الرحلة

# dayStreakLabel
source: Day Streak
ar: سلسلة الأيام

# motivationalProgress
source: Great progress, {name}! Keep going!
ar: تقدم رائع يا {name}! استمر!

# motivationalStreak
source: Amazing streak, {name}! You're on fire!
ar: سلسلة مذهلة يا {name}! أنت متألق!

# motivationalLearning
source: Keep exploring, {name}! The world awaits!
ar: واصل الاستكشاف يا {name}! العالم ينتظرك!

# motivationalQuiz
source: You're getting smarter, {name}!
ar: أصبحت أذكى يا {name}!

# motivationalWelcome
source: Welcome back, {name}! Ready to explore?
ar: مرحباً بعودتك يا {name}! هل أنت مستعد للاستكشاف؟

# motivationalAchievement
source: Well done, {name}! You're a star!
ar: أحسنت يا {name}! أنت نجم!

# worldMapTitle
source: World Map
ar: خريطة العالم

source: Explore the World
ar: استكشف العالم

# searchCountriesPlaceholder
source: Search countries...
ar: ابحث عن الدول...

# randomCountry
source: Random
ar: عشوائي

# findingLocation
source: Finding your location...
ar: جارٍ تحديد موقعك...

# view3D
source: 3D View Feature
ar: العرض ثلاثي الأبعاد

# mapLegend
source: Legend
ar: دليل الألوان

# legendMastered
source: Mastered
ar: متقن

# legendAdvanced
source: Advanced
ar: متقدم

# legendIntermediate
source: Intermediate
ar: متوسط

# legendBeginner
source: Beginner
ar: مبتدئ

# legendStarted
source: Started
ar: بدأ التعلم

# legendNotStarted
source: Not Started
ar: لم يبدأ

# mapFilterAll
source: All
ar: الكل

# mapFilterComplete
source: Complete
ar: مكتمل

# mapFilterInProgress
source: In Progress
ar: قيد التعلم

# mapFilterNotStarted
source: Not Started
ar: لم يبدأ

# mapFilterFavorites
source: Favorites
ar: المفضلة

# mapStatsCountries
source: Countries
ar: الدول

# mapStatsExplored
source: Explored
ar: مستكشفة

# mapStatsFavorites
source: Favorites
ar: المفضلة

source: Continent Explorer
ar: مستكشف القارات

# continentProgress
source: Progress
ar: التقدم

# continentCountries
source: {count} Countries
ar: {count} دولة

source: Continue Exploring
ar: تابع الاستكشاف

source: Start Exploring
ar: ابدأ الاستكشاف

# tabOverview
source: Overview
ar: نظرة عامة

# tabGeography
source: Geography
ar: الجغرافيا

# tabCulture
source: Culture
ar: الثقافة

# tabTravel
source: Travel
ar: السفر

# tabLearn
source: Learn
ar: تعلم

source: Live Info
ar: معلومات حية

source: Current Time
ar: الوقت الحالي

source: Season
ar: الفصل

source: Time Difference
ar: فرق التوقيت

source: Quick Facts
ar: حقائق سريعة

source: Flag Meaning
ar: معنى العلم

source: Flag History
ar: تاريخ العلم

source: Neighboring Countries
ar: الدول المجاورة

# noNeighbors
source: Island nation - no land borders
ar: جزيرة - لا حدود برية

source: Terrain
ar: التضاريس

source: Terrain Breakdown
ar: توزيع التضاريس

source: Climate
ar: المناخ

source: Climate Zones
ar: المناطق المناخية

source: Natural Hazards
ar: الكوارث الطبيعية

# noHazards
source: No major natural hazards
ar: لا توجد مخاطر طبيعية كبرى

source: Administrative Regions
ar: التقسيمات الإدارية

source: Traditional Foods
ar: الأطعمة التقليدية

source: Traditional Arts
ar: الفنون التقليدية

# festivals
source: Festivals & Celebrations
ar: الأعياد والاحتفالات

# unescoSites
source: UNESCO World Heritage Sites
ar: مواقع التراث العالمي

source: Famous People
ar: مشاهير

source: Fun Facts
ar: حقائق ممتعة

source: Top Places to Visit
ar: أفضل الأماكن للزيارة

source: Travel Essentials
ar: أساسيات السفر

source: Visa
ar: التأشيرة
