Repository: htirawi/geo_master
Catalog: lib/l10n/app_*.arb
Languages: ar

# visaRequired
source: Required
ar: مطلوبة

# visaNotRequired
source: Not Required
ar: غير مطلوبة

source: Voltage
ar: الجهد الكهربائي

source: Plug Type
ar: نوع المقبس

source: Essential Phrases
ar: عبارات أساسية

source: Travel Tips
ar: نصائح السفر

source: Your Progress
ar: تقدمك

source: Flashcards
ar: البطاقات التعليمية

source: Country Quiz
ar: اختبار الدولة

source: Test your knowledge
ar: اختبر معلوماتك

source: Learning Modules
ar: وحدات التعلم

source: AI Tutor Chat
ar: محادثة المعلم الذكي

# chatAboutCountry
source: Chat about this country
ar: تحدث عن هذه الدولة

source: Historical Timeline
ar: الخط الزمني التاريخي

# compareWithOther
source: Compare with Another Country
ar: قارن مع دولة أخرى

source: Bookmarked Facts
ar: الحقائق المحفوظة

# noBookmarks
source: No bookmarked facts yet
ar: لا توجد حقائق محفوظة بعد

source: Media Gallery
ar: معرض الوسائط

source: Photos
ar: صور

source: Videos
ar: فيديو

source: News
ar: أخبار

# placeTypeLandmark
source: Landmark
ar: معلم

# placeTypeNature
source: Nature
ar: طبيعة

# placeTypeMuseum
source: Museum
ar: متحف

# placeTypeHistoric
source: Historic
ar: تاريخي

# placeTypeReligious
source: Religious
ar: ديني

# placeTypePark
source: Park
ar: حديقة

# placeTypeBeach
source: Beach
ar: شاطئ

# placeTypeMountain
source: Mountain
ar: جبل

# placeTypeLake
source: Lake
ar: بحيرة

# placeTypeWaterfall
source: Waterfall
ar: شلال

# placeTypeCastle
source: Castle
ar: قلعة

# placeTypePalace
source: Palace
ar: قصر

# placeTypeTemple
source: Temple
ar: معبد

# placeTypeMonument
source: Monument
ar: نصب تذكاري

# placeTypeBridge
source: Bridge
ar: جسر

# placeTypeTower
source: Tower
ar: برج

# placeTypeMarket
source: Market
ar: سوق

# placeTypeNeighborhood
source: District
ar: حي

# placeTypeOther
source: Other
ar: أخرى

# progressNotStarted
source: Not Started
ar: لم يبدأ

# progressStarted
source: Started
ar: بدأ

# progressBeginner
source: Beginner
ar: مبتدئ

# progressIntermediate
source: Intermediate
ar: متوسط

# progressAdvanced
source: Advanced
ar: متقدم

# progressMastered
source: Mastered
ar: متقن

# exploreCountry
source: Explore
ar: استكشف

source: Add to Favorites
ar: إضافة للمفضلة

source: Remove from Favorites
ar: إزالة من المفضلة

# shareCountry
source: Share
ar: مشاركة

source: {percent}% explored
ar: {percent}% مستكشف

source: No results found
ar: لم يتم العثور على نتائج

# searchForCountry
source: Search for any country in the world
ar: ابحث عن أي دولة في العالم

# flagAndColors
source: Flag & Colors
ar: العلم والألوان

# flagColorsMeaning
source: What the Colors Mean
ar: ماذا تعني الألوان

# flagSymbolism
source: Symbolism
ar: الرمزية

source: National Flag
ar: العلم الوطني

# tapToLearnMore
source: Tap to learn about the flag colors
ar: انقر لمعرفة المزيد عن ألوان العلم

# colorMeaningUnavailable
source: Color meanings not available for this flag
ar: معاني الألوان غير متوفرة لهذا العلم

# additionalInfo
source: Additional Information
ar: معلومات إضافية

source: Hex Code
ar: رمز اللون

source: Copied to clipboard
ar: تم النسخ

source: Game Modes
ar: أوضاع اللعب

source: Choose Topic
ar: اختر نوع السؤال

# quickQuizMode
source: Quick
ar: سريع

# quickQuizQuestions
source: 5 Qs
ar: 5 أسئلة

# timedBlitzMode
source: Blitz
ar: البرق

# timedBlitzMultiplier
source: 2× XP
ar: 2× نقاط

# continentChallengeMode
source: Continent
ar: القارة

# marathonMode
source: Marathon
ar: ماراثون

# marathonQuestions
source: 50 Qs
ar: 50 سؤال

# studyModeLabel
source: Study
ar: دراسة

# studyModeNoXp
source: No XP
ar: بدون نقاط

# reverseFlagsQuiz
source: Reverse Flags
ar: الأعلام المعكوسة

# reverseFlagsDescription
source: Select the flag for the country
ar: اختر العلم الصحيح للدولة

# languagesQuizTitle
source: Languages
ar: اللغات

# languagesQuizDescription
source: Identify official languages
ar: حدد اللغات الرسمية

# neighborsQuiz
source: Neighbors
ar: الدول المجاورة

# neighborsQuizDescription
source: Select neighboring countries
ar: اختر الدول المجاورة

# mixedQuizTitle
source: Mixed
ar: مختلط

# mixedQuizDescription
source: Random mix of all topics
ar: خليط عشوائي من جميع المواضيع

# sessionTypeQuickQuiz
source: Quick Quiz
ar: اختبار سريع

# sessionTypeContinentChallenge
source: Continent Challenge
ar: تحدي القارة

# sessionTypeTimedBlitz
source: Timed Blitz
ar: وضع البرق

# sessionTypeDailyChallenge
source: Daily Challenge
ar: التحدي اليومي

# sessionTypeMarathon
source: Marathon
ar: ماراثون

# sessionTypeStudyMode
source: Study Mode
ar: وضع الدراسة

# sessionTypeStandard
source: Quiz
ar: اختبار

source: Select Continent
ar: اختر القارة

# exitQuizTitle
source: Exit Quiz?
ar: الخروج من الاختبار؟

# exitQuizMessage
source: Your progress will be lost. Are you sure you want to exit?
ar: سيتم فقدان تقدمك. هل أنت متأكد من الخروج؟

# exitButton
source: Exit
ar: خروج

# useHint
source: Use Hint (-5 XP)
ar: استخدم تلميح (-5 نقاط)

source: Confirm Answers
ar: تأكيد الإجابات

source: Show Answer
ar: اظهر الإجابة

# selectAnswersCount
source: Select {count} answers
ar: اختر {count} إجابات

source: Explanation
ar: شرح

source: Did you know?
ar: هل تعلم؟

source: Game Over!
ar: انتهت اللعبة!

# perfectScoreTitle
source: Perfect Score!
ar: درجة كاملة!

# gradeAPlus
source: A+
ar: أ+

# gradeA
source: A
ar: أ

# gradeB
source: B
ar: ب

# gradeC
source: C
ar: ج

# gradeD
source: D
ar: د

# gradeF
source: F
ar: هـ

# gradeExcellentPlus
source: Excellent+
ar: ممتاز+

# gradeExcellent
source: Excellent
ar: ممتاز

# gradeVeryGood
source: Very Good
ar: جيد جداً

# gradeGood
source: Good
ar: جيد

# gradePass
source: Pass
ar: مقبول

# gradeFail
source: Fail
ar: ضعيف

# levelLabel
source: Level
ar: المستوى

# modeLabel
source: Mode
ar: النوع

# bonusesAndPenalties
source: Bonuses & Penalties
ar: المكافآت والخصومات

source: Streak Bonus
ar: مكافأة السلسلة

source: Speed Bonus
ar: مكافأة السرعة

# hintsLabel
source: Hints
ar: تلميحات

# perfectStreakLabel
source: Perfect Streak
ar: سلسلة مثالية

source: Performance Analysis
ar: تحليل الأداء

# strongAreas
source: Your Strengths
ar: نقاط القوة

source: Needs Improvement
ar: تحتاج تحسين

source: New Achievements!
ar: إنجازات جديدة!

# achievementPerfectQuiz
source: Perfect Quiz!
ar: اختبار مثالي!

# achievementMarathonMaster
source: Marathon Master!
ar: أسطورة الماراثون!

# achievementDailyChallenger
source: Daily Challenger!
ar: بطل التحدي اليومي!

# achievementSpeedDemon
source: Speed Demon!
ar: سريع البرق!

# achievementStreakMaster
source: Streak Master!
ar: سيد السلسلة!

# areaCapitals
source: Capitals
ar: العواصم

# areaFlags
source: Flags
ar: الأعلام

# areaReverseFlags
source: Reverse Flags
ar: أعلام معكوسة

# areaMaps
source: Maps
ar: الخرائط

# areaPopulation
source: Population
ar: السكان

# areaCurrencies
source: Currencies
ar: العملات

# areaLanguages
source: Languages
ar: اللغات

# areaBorders
source: Borders
ar: الحدود

# areaTimezones
source: Timezones
ar: المناطق الزمنية

# xpMultiplierInfo
source: {multiplier}x multiplier from {sessionType}
ar: مضاعف {multiplier}x من {sessionType}

# streakBonusPercent
source: +{percent}% Streak Bonus
ar: +{percent}% مكافأة السلسلة

# streak3Days
source: 3 Day Streak: +10% XP
ar: سلسلة 3 أيام: +10% نقاط

# streak7Days
source: 7 Day Streak: +25% XP
ar: سلسلة 7 أيام: +25% نقاط

# streak14Days
source: 14 Day Streak: +50% XP
ar: سلسلة 14 يوم: +50% نقاط

# streak30Days
source: 30 Day Streak: +100% XP
ar: سلسلة 30 يوم: +100% نقاط

# livesRemaining
source: {count} Lives
ar: {count} أرواح

source: Out of lives!
ar: نفدت الأرواح!

# timeUp
source: Time's up!
ar: انتهى الوقت!

# atlasWelcome
source: Hi! I'm Atlas, your geography guide!
ar: مرحباً! أنا أطلس، مرشدك الجغرافي!

# atlasQuiz
source: Let's test what you've learned!
ar: هيا نختبر ما تعلمته!

# atlasAskMe
source: Ask me anything about the world!
ar: اسألني أي شيء عن العالم!

# atlasAchievements
source: Earn achievements and become a legend!
ar: احصل على الإنجازات وكن أسطورة!

# levelUpTitle
source: LEVEL UP!
ar: مستوى جديد!

# nextLevelXp
source: Next level: {xp} XP
ar: المستوى التالي: {xp} نقطة

source: Tap to continue
ar: اضغط للمتابعة

# consecutiveDayStreak
source: Day Streak
ar: يوم متتالي

# xpBonusLabel
source: Bonus
ar: مكافأة

# streakGettingStarted
source: Getting Started!
ar: بداية موفقة!

# streakWeekWarrior
source: Week Warrior!
ar: محارب الأسبوع!

# streakTwoWeekChampion
source: Two Week Champion!
ar: بطل الأسبوعين!

# streakMonthlyMaster
source: Monthly Master!
ar: سيد الشهر!

# streakCenturyLegend
source: Century Legend!
ar: أسطورة المئة!

# levelNovice
source: Novice Explorer
ar: مستكشف مبتدئ

# levelApprentice
source: Apprentice
ar: متدرب

# levelJourneyman
source: Journeyman
ar: رحالة

# levelExpert
source: Expert
ar: خبير

# levelMaster
source: Master
ar: أستاذ

# levelGrandmaster
source: Grandmaster
ar: أسطورة

# levelLegend
source: Legend
ar: أسطوري

# levelMythic
source: Mythic
ar: خرافي

# dailyChallengeTitle
source: Daily Challenge
ar: التحدي اليومي

# dailyChallengeComplete
source: Challenge Complete!
ar: تم إكمال التحدي!

# dailyChallengeStreak
source: Challenge Streak: {count}
ar: سلسلة التحديات: {count}

# dailyChallengeNextIn
source: Next challenge in {time}
ar: التحدي التالي في {time}

# challengeTypeCompleteQuizzes
source: Complete {count} quizzes
ar: أكمل {count} اختبارات

# challengeTypePerfectScore
source: Get a perfect score
ar: احصل على علامة كاملة

# challengeTypeLearnCountries
source: Learn {count} new countries
ar: تعلم {count} دول جديدة

# challengeTypeSpeedChallenge
source: Answer {count} questions quickly
ar: أجب على {count} أسئلة بسرعة

# challengeTypeStudyTime
source: Study for {minutes} minutes
ar: ادرس لمدة {minutes} دقيقة

# challengeDifficultyEasy
source: Easy
ar: سهل

# challengeDifficultyMedium
source: Medium
ar: متوسط

# challengeDifficultyHard
source: Hard
ar: صعب

# weeklyGoalsTitle
source: Weekly Goals
ar: الأهداف الأسبوعية

# weeklyGoalsProgress
source: {completed}/{total} goals completed
ar: {completed}/{total} أهداف مكتملة

# weeklyGoalXpReward
source: +{xp} XP
ar: +{xp} نقطة

# goalTypeEarnXp
source: Earn {amount} XP
ar: اكسب {amount} نقطة

# goalTypeCompleteQuizzes
source: Complete {count} quizzes
ar: أكمل {count} اختبارات

# goalTypeLearnCountries
source: Learn {count} countries
ar: تعلم {count} دول

# goalTypePerfectScores
source: Get {count} perfect scores
ar: احصل على {count} علامات كاملة

# goalTypeStudyDays
source: Study on {count} days
ar: ادرس {count} أيام

# goalTypeChallenges
source: Complete {count} daily challenges
ar: أكمل {count} تحديات يومية

# weekEndsIn
source: Week ends in {time}
ar: ينتهي الأسبوع في {time}

# friendsTitle
source: Friends
ar: الأصدقاء

# friendsCount
source: {count} friends
ar: {count} أصدقاء

# friendCodeLabel
source: Your Friend Code
ar: رمز الصداقة الخاص بك

source: Friend code copied!
ar: تم نسخ رمز الصداقة!

# addFriendTitle
source: Add Friend
ar: إضافة صديق

# addFriendHint
source: Enter friend code
ar: أدخل رمز الصداقة

# sendFriendRequest
source: Send Request
ar: إرسال طلب

source: Friend request sent!
ar: تم إرسال طلب الصداقة!

# friendRequestsTitle
source: Friend Requests
ar: طلبات الصداقة

# acceptFriendRequest
source: Accept
ar: قبول

# declineFriendRequest
source: Decline
ar: رفض

source: Remove Friend
ar: إزالة صديق

# removeFriendConfirm
source: Are you sure you want to remove this friend?
ar: هل أنت متأكد من إزالة هذا الصديق؟

source: No friends yet
ar: لا يوجد أصدقاء بعد

# friendOnline
source: Online
ar: متصل

# friendOffline
source: Offline
ar: غير متصل

# challengeFriend
source: Challenge
ar: تحدي

# duelTitle
source: Duel
ar: مبارزة

# duelChallenge
source: Challenge to Duel
ar: تحدي لمبارزة

# duelPending
source: Pending
ar: قيد الانتظار

# duelInProgress
source: In Progress
ar: جاري

# duelCompleted
source: Completed
ar: مكتمل

# duelExpired
source: Expired
ar: منتهي الصلاحية

# duelDeclined
source: Declined
ar: مرفوض

# duelWin
source: Victory!
ar: فوز!

# duelLose
source: Defeat
ar: خسارة

# duelDraw
source: Draw
ar: تعادل

# duelScore
source: Score: {score}
ar: النتيجة: {score}

# duelQuestions
source: {count} questions
ar: {count} أسئلة

# duelTimePerQuestion
source: {seconds}s per question
ar: {seconds} ثانية لكل سؤال

# duelAccept
source: Accept Challenge
ar: قبول التحدي

# duelDecline
source: Decline
ar: رفض

# duelConfigTitle
source: Configure Duel
ar: إعداد المبارزة

# duelTypeFlags
source: Flags
ar: الأعلام

# duelTypeCapitals
source: Capitals
ar: العواصم

# duelTypeCountries
source: Countries
ar: الدول

# duelTypeMixed
source: Mixed
ar: مختلط

# tournamentTitle
source: Tournament
ar: البطولة

# tournamentActive
source: Active Tournament
ar: بطولة نشطة

# tournamentUpcoming
source: Upcoming
ar: قادم

# tournamentCompleted
source: Completed
ar: مكتمل

# tournamentCancelled
source: Cancelled
ar: ملغى

# tournamentJoin
source: Join Tournament
ar: انضم للبطولة

# tournamentLeave
source: Leave
ar: مغادرة

# tournamentParticipants
source: participants
ar: {count} مشاركين

# tournamentEndsIn
source: Ends in {time}
ar: تنتهي في {time}

# tournamentStartsIn
source: Starts in {time}
ar: تبدأ في {time}

# tournamentYourRank
source: Your Rank: #{rank}
ar: ترتيبك: #{rank}

# tournamentPrizes
source: Prizes
ar: الجوائز

# tournamentWeekly
source: Weekly
ar: أسبوعي

# tournamentMonthly
source: Monthly
ar: شهري

# tournamentContinent
source: Continent
ar: قارة

# tournamentSpecial
source: Special Event
ar: حدث خاص

# statsTitle
source: Statistics
ar: الإحصائيات

# statsTotalXp
source: Total XP
ar: إجمالي النقاط

# statsLevel
source: Level
ar: المستوى

# statsAccuracy
source: Accuracy
ar: الدقة

# statsStreak
source: Current Streak
ar: السلسلة الحالية

# statsLongestStreak
source: Longest Streak
ar: أطول سلسلة

# statsQuizzesCompleted
source: Quizzes Completed
ar: الاختبارات المكتملة

# statsPerfectScores
source: Perfect Scores
ar: العلامات الكاملة

# statsCountriesLearned
source: Countries Learned
ar: الدول المتعلمة

# statsStudyTime
source: Study Time
ar: وقت الدراسة

# statsWeakAreas
source: Areas to Improve
ar: مجالات للتحسين

# statsStrongAreas
source: Your Strengths
ar: نقاط القوة

# statsActivityHistory
source: Activity History
ar: سجل النشاط

# statsAccuracyByContinent
source: Accuracy by Continent
ar: الدقة حسب القارة

# statsAccuracyByQuizType
source: Accuracy by Quiz Type
ar: الدقة حسب نوع الاختبار

# subscriptionFree
source: Free
ar: مجاني

# subscriptionBasic
source: Basic
ar: أساسي

# subscriptionPro
source: Pro
ar: برو

# subscriptionPremium
source: Premium
ar: بريميوم

# subscriptionUpgrade
source: Upgrade
ar: ترقية

# featureUnlimitedQuizzes
source: Unlimited Quizzes
ar: اختبارات غير محدودة

# featureAdvancedStats
source: Advanced Stats
ar: إحصائيات متقدمة

# featureFriendsDuels
source: Friend Duels
ar: مبارزات الأصدقاء

# featureCustomChallenges
source: Custom Challenges
ar: تحديات مخصصة

# featureExportStats
source: Export Stats
ar: تصدير الإحصائيات

# featureNoAds
source: No Ads
ar: بدون إعلانات

# featurePrioritySupport
source: Priority Support
ar: دعم أولوية

# featureExclusiveAchievements
source: Exclusive Achievements
ar: إنجازات حصرية

# featureTournamentAccess
source: Tournament Access
ar: الوصول للبطولات

# featureOfflineMode
source: Offline Mode
ar: وضع عدم الاتصال

source: Limit reached
ar: تم الوصول للحد

source: Upgrade to unlock
ar: قم بالترقية للفتح

# leaderboardGlobal
source: Global
ar: عالمي

# leaderboardFriends
source: Friends
ar: الأصدقاء

# leaderboardWeekly
source: Weekly
ar: أسبوعي

# leaderboardRegional
source: Regional
ar: إقليمي

# tournamentsTitle
source: Tournaments
ar: البطولات

# tournamentSubtitle
source: Compete with explorers worldwide
ar: تنافس مع المستكشفين حول العالم

# tournamentLeaderboard
source: Leaderboard
ar: لوحة المتصدرين

# tournamentRewards
source: Rewards
ar: المكافآت

# tournamentJoinNow
source: Join Now
ar: انضم الآن

# tournamentJoined
source: Joined
ar: مشترك

# tournamentRemaining
source: remaining
ar: متبقي

# tournamentEnding
source: Ending soon
ar: ينتهي قريباً

source: No active tournament
ar: لا توجد بطولة نشطة

source: No upcoming tournaments
ar: لا توجد بطولات قادمة

# noLeaderboardData
source: No leaderboard data yet
ar: لا توجد بيانات في لوحة المتصدرين

source: Starts in
ar: يبدأ في

# tournamentRegistered
source: Registered
ar: مسجل

# tournamentRegister
source: Register
ar: تسجيل

# daysShort
source: d
ar: ي

# hoursShort
source: h
ar: س

# minutesShort
source: m
ar: د

source: days left
ar: أيام متبقية

# statsSubtitle
source: Track your learning progress
ar: تتبع تقدمك في التعلم

# statsOverview
source: Overview
ar: نظرة عامة

source: Total XP
ar: إجمالي النقاط

# currentStreak
source: Streak
ar: السلسلة

# perfectScores
source: Perfect
ar: كامل

source: Activity History
ar: سجل النشاط

source: Less
ar: أقل

source: More
ar: أكثر

source: Accuracy by Category
ar: الدقة حسب الفئة

source: No data yet
ar: لا توجد بيانات بعد

# quizTypeFlags
source: Flags
ar: الأعلام

# quizTypeCapitals
source: Capitals
ar: العواصم

# quizTypeMaps
source: Maps
ar: الخرائط

# quizTypeMixed
source: Mixed
ar: مختلط

# weakAreas
source: Areas to Improve
ar: مجالات للتحسين

source: Practice
ar: تدريب

source: Countries by Continent
ar: الدول حسب القارة

# continentAfrica
source: Africa
ar: أفريقيا

# continentAsia
source: Asia
ar: آسيا

# continentEurope
source: Europe
ar: أوروبا

# continentNorthAmerica
source: North America
ar: أمريكا الشمالية

# continentSouthAmerica
source: South America
ar: أمريكا الجنوبية

# continentOceania
source: Oceania
ar: أوقيانوسيا

# weeklyGoalsSubtitle
source: Set and achieve your weekly targets
ar: حدد وحقق أهدافك الأسبوعية

# goalsCompleted
source: Completed
ar: مكتمل

# completionRate
source: Completion
ar: نسبة الإكمال

# noGoalsYet
source: No goals set
ar: لا توجد أهداف

# setWeeklyGoals
source: Set your weekly goals to track progress
ar: حدد أهدافك الأسبوعية لتتبع التقدم

source: Add Goal
ar: إضافة هدف

source: Select Goal Type
ar: اختر نوع الهدف

source: Target
ar: الهدف
